
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana1&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules[&#34;grafana2&#34;]
* Update
  * azurerm_key_vault_secret.FLEXIBLE-DB-URL[0]
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;dashboard&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.FLEXIBLE-DB-URL[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "FLEXIBLE-DB-URL" {
        id                      = "https://dtsse-aat.vault.azure.net/secrets/flexible-db-url/5a307591f8f04bffbbc88703a469ef70"
        name                    = "flexible-db-url"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-aat/providers/Microsoft.KeyVault/vaults/dtsse-aat|dtsse-aat"
        name                       = "dtsse-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql" -> null # forces replacement
      ~ fqdn                          = "dtsse-dashboard-flexdb-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" -> (known after apply)
        name                          = "dtsse-dashboard-flexdb-aat"
      ~ private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" -> (known after apply)
      ~ public_network_access_enabled = false -> (known after apply)
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/dtsse-shared-infrastructure.git"
            "application"         = "core"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#reform-swe"
            "environment"         = "staging"
            "managedBy"           = "DTS Software Engineering"
        }
      - zone                          = "3" -> null
        # (10 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_database.pg_databases["dashboard"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat/databases/dashboard" -> (known after apply)
        name      = "dashboard"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dtsse-dashboard-flexdb-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/dtsse-dashboard-flexdb-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana1"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      + end_ip_address   = "52.148.220.236"
      + id               = (known after apply)
      + name             = "grafana1"
      + server_id        = (known after apply)
      + start_ip_address = "52.148.220.236"
    }

  # module.postgresql[0].azurerm_postgresql_flexible_server_firewall_rule.pg_firewall_rules["grafana2"] will be created
  + resource "azurerm_postgresql_flexible_server_firewall_rule" "pg_firewall_rules" {
      + end_ip_address   = "20.61.85.167"
      + id               = (known after apply)
      + name             = "grafana2"
      + server_id        = (known after apply)
      + start_ip_address = "20.61.85.167"
    }

Plan: 5 to add, 2 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":50,"Program":"tfcmt","SHA1":"","Vars":{}} -->